/**
 * English strings
 */
export default {
  translation: {
    'APP_TITLE': '서류 가방',
    'NAV': {
      'HOME': '집',
      'RESUME': '이력서',
      'LANGUAGE': '한국',
      'PROJECTS': '프로젝트',
      'ARTICLES': '기사들',
      'HISTORY': '역사',
    },
    'HOME': {
      'DESCRIPTION': 'Laravel 및 JavaScript를 사용하는 전체 스택 개발자.'
    },
    'SKILLS': {
      'HEADER': '기술들',
      'SKILL_1': '회사 내부 어플리케이션까지 전자상거래 어플리케이션을 만드는 등 총 4년간의 웹 개발 경험이 있습니다.',
      'SKILL_2': '보상, 배송 정보, 추적 등 전자상거래 웹사이트용 앱을 개발한 경험이 2년 있습니다.',
      'SKILL_3': '관리자와 직원이 회사 관련 각종 정보를 보고 관리하는 데 사용한 사내 정보 및 관리 소프트웨어를 개발한 경험이 2년 있습니다.',
      'SKILL_4': '백엔드용 Laravel PHP 프레임워크 및 프런트엔드 개발을 위한 리액트 및 Vue와 같은 JavaScript 프레임워크를 사용한 경험이 4년 있습니다.',
      'SKILL_5': '우리 팀 앱의 데이터베이스 구조 설계를 도왔습니다.',
      'SKILL_6': '유닛 테스트 생성 경험이 있습니다.',
      'SKILL_7': 'Jira 및 Confluence와 같은 Atlassian 도구를 사용하여 문서를 작성한 경험이 있습니다.'
    },
    'ACHIEVEMENTS': {
      'HEADER': '성과',
      'UNIVERSITY': '대학',
      'ACHIEVEMENT_1': '최우수 연구 제안서(2018)',
      'ACHIEVEMENT_2': '패널리스트 초이스 어워드(2018)',
      'ACHIEVEMENT_3': '최우수 연구논문(2018)',
      'ACHIEVEMENT_4': '1위 : C# 프로그래밍 챌린지 (2017)',
      'ACHIEVEMENT_5': '3위 : 프로그래밍 경진대회(2016)',
      'ACHIEVEMENT_6': '1위 : 프로그래밍 경진대회(2015)'
    },
    'WORK_EXPERIENCE': {
      'HEADER': '근무 경험',
      'WORK_EXPERIENCE_1_1': '직원들이 스케줄을 보고, 휴가를 내고, 개인 정보를 얻을 수 있는 정보 시스템을 개발했습니다. 또한 HR 및 관리자가 앱 내에서 퇴사 승인 설정, 퇴사 생성 설정, 직원 정보 및 근무일 설정을 편집할 수 있습니다. 또한 크론 작업을 통해 회사 정보와 부서 할당을 자동으로 마이그레이션합니다. 지점별, 직장별 증·생성 설정에 따라 휴직 크레딧도 생성합니다.',
      'WORK_EXPERIENCE_1_1_1': 'Laravel, Vue 및 MySQL을 사용했습니다.',
      'WORK_EXPERIENCE_1_1_2': '개발을 위한 웹 개발자 팀을 이끌었습니다.',
      'WORK_EXPERIENCE_1_1_3': '이 앱 개발에 필요한 소프트웨어 사양 및 요구 사항을 분석 및 작성했습니다.',
      'WORK_EXPERIENCE_1_1_4': '프로덕션 서버에 주요 사례 및 개선 사항을 배치했습니다.',
      'WORK_EXPERIENCE_1_1_5': '프로젝트를 위한 개발 및 배치 계획을 수립했습니다.',
      'WORK_EXPERIENCE_1_1_6': '각 사례 및 개선 사항에 대한 견적을 제공했습니다.',
      'WORK_EXPERIENCE_2_1': '앱에서 제공하는 링크를 사용하여 인플루언서의 팬 구매를 기반으로 보상 앱을 개발했습니다. 사용자가 체크아웃한 상품을 추적·기록해 총가격을 산출한 뒤 쇼핑몰 관리자가 설정한 비율에 따라 보상 포인트를 준다.',
      'WORK_EXPERIENCE_2_1_1': 'Laravel, ReactJS, REDIS 및 MySQL을 사용했습니다.',
      'WORK_EXPERIENCE_2_1_2': '회사의 OAuth 2.0 기반 API를 사용했습니다.',
      'WORK_EXPERIENCE_2_1_3': '또한 회사의 사내 IFTT와 같은 API를 사용했습니다.',
      'WORK_EXPERIENCE_2_2': '쇼핑몰 이용자들이 특정 상품을 어디로 배송할 수 있는지 알 수 있는 앱을 개발했습니다. 관리자가 특정 제품에 대해 설정한 국가 리스트를 보여줍니다. 또 요청 헤더에서 국가코드를 가져와 쇼핑몰 관리자가 구매하려는 상품에 설정한 국가에 사용자의 국가가 포함되지 않았을 때 경보를 발령한다.',
      'WORK_EXPERIENCE_2_2_1': 'Laravel, jQuery 및 REDIS를 사용했습니다.',
      'WORK_EXPERIENCE_2_2_2': '회사의 OAuth 2.0 기반 API를 사용했습니다.',
      'WORK_EXPERIENCE_2_3': '쇼핑몰 내 상품 방문 횟수를 추적해 조회 통계와 이용자가 쇼핑몰 내에서 어떤 페이지를 방문하고 있는지 보여주는 그래프를 웹페이지에 제시하는 앱을 개발했다.',
      'WORK_EXPERIENCE_2_3_1': 'Laravel, jQuery, REDIS 및 MySQL을 사용했습니다.',
      'WORK_EXPERIENCE_2_3_2': '회사의 OAuth 2.0 기반 API를 사용했습니다.',
      'WORK_EXPERIENCE_2_4': 'Laravel의 내장된 Facade 기능을 활용하여 회사의 오래된 직원 정보 시스템에 액세스하고 보다 의미적으로 아름다운 방식으로 실행하는 Composer 패키지를 개발했습니다.',
      'WORK_EXPERIENCE_2_5': '수년 전 개발자들이 제공한 오래된 기능 코드를 객체 지향적이고 Laravel 친화적인 함수에 이식하는 또 다른 Composer 패키지를 개발했습니다. 직원정보시스템 내에서 회사 웹메일 앱의 자동 로그인을 용이하게 합니다.',
      'WORK_EXPERIENCE_2_6': 'Laravel의 ORM 패키지인 Eloquent의 기능과 기능에 대해 종종 간과되는 기술 블로그를 만들고 게시했습니다.',
      'WORK_EXPERIENCE_3_1': '직원의 근무 시간 및 근무 중지를 모니터링, 표시 및 처리하고 총 급여를 계산하는 앱을 개발했습니다.',
      'WORK_EXPERIENCE_3_1_1': 'Zend Framework, jQuery 및 MySQL을 사용했습니다.',
    },
    'EDUCATION': {
      'HEADER': '교육'
    },
    'WHAT_I_DO': {
      'HEADER': '내가 하는 일',
      'DESCRIPTION': '저는 고객 대면 웹 애플리케이션 개발 경험이 4년 있습니다. 아래는 제 기술력 중 일부입니다.',
      'WHAT_I_DO_1': 'PHP와 Laravel을 이용한 백엔드 웹 애플리케이션 개발 4년 경험.',
      'WHAT_I_DO_2': '효율적인 웹 애플리케이션을 위해 정규화되고 최적화된 테이블 및 쿼리를 만든 4년의 경험.',
      'WHAT_I_DO_3': 'ES6, ES5 자바스크립트 기능을 활용한 웹 애플리케이션 개발 1년 경력입니다.',
      'WHAT_I_DO_4': 'Vue 2, Vuex, Vue i18n 및 Vue Router를 사용하여 프런트 엔드 애플리케이션을 만든 지 2년이 되었습니다.',
      'WHAT_I_DO_5': '리액트 웹 애플리케이션 코딩 1년 경력.',
    },
    'ARTICLES': {
      'HEADER': '내 기사'
    },
    'PROJECTS': {
      'PROJECT_1_DESCRIPTION': '프로젝트와 스킬을 표시합니다.(지금 보고 계십니다!)',
      'PROJECT_2_DESCRIPTION': '페이지와 카드를 생성하여 개인 대시보드로 설정할 수 있습니다.',
      'PROJECT_3_DESCRIPTION': '이것은 SAPUI5 개발자가 보일러 플레이트 파일을 만들 수 있도록 지원하는 NPM 패키지입니다.',
      'PROJECT_4_DESCRIPTION': '이건 제 논문 프로젝트입니다. 영상 처리와 뉴럴 네트워크를 이용하여 녹내장을 검출합니다.',
    },
    'HISTORY': {
      'HEADER': 'History',
      'HISTORY_1_1': '직원들이 스케줄을 보고, 휴가를 내고, 개인 정보를 얻을 수 있는 정보 시스템을 개발했습니다. 또한 HR 및 관리자는 앱 내에서 탈퇴 승인 설정, 탈퇴 세대 설정, 직원 정보 및 근무일 설정을 편집할 수 있습니다.',
      'HISTORY_1_2': '앱에서 제공하는 링크를 사용하여 인플루언서의 팬 구매를 기반으로 한 보상 앱을 개발했습니다. 그것은 사용자의 체크아웃된 아이템을 추적하고 기록하고, 그것들의 총 가격을 계산한 다음, 쇼핑몰 관리자가 설정한 퍼센트에 따라 보상 포인트를 준다.',
      'HISTORY_1_3': '쇼핑몰 사용자들이 특정 제품을 어디로 배송할 수 있는지 볼 수 있는 앱을 개발했습니다. 관리자가 특정 제품에 대해 설정한 국가 목록을 표시합니다. 또한 요청 헤더에서 국가 코드를 가져오고 사용자의 국가가 쇼핑몰 관리자가 구매 중인 제품에 설정한 국가에 포함되지 않을 경우 경고를 보냅니다.',
      'HISTORY_1_4': '쇼핑몰 내 상품 방문 횟수를 추적해 웹페이지에 보기 통계와 사용자가 몰 내에서 방문하는 페이지 수를 나타내는 그래프를 제시하는 앱을 개발했다.',
      'HISTORY_2_1': '직원의 근무 시간 및 시간 초과를 모니터링하고 표시 및 처리하고 총 급여를 계산하는 앱을 개발했습니다.'
    }
  }
};